clear all;
close all;
clc;
%%直接位置型更新策略测试

num=10;
for kc=1:num
    n=10;
    index=0;
    for i=2:2
        for j=1:2
            a=zeros(1,n);
            b=zeros(1,n);
            for k=1:n
                a(k)=direct_partcle1(i,j);%%0线性递减型（左边）                              1选择速度型位置更新策略（右边）
                %b(k)=direct_partcle1(2,2);%%1线性递增型（左边）                              2或者其他选择直接位置型位置更新策略（右边）
            end                           %%2非线性递增型 ，其他数字w恒定为0.8（左边）
                index=index+1;
                 rec_best(index,:)=a;%%记录每个方法多次重复后各自的适应度值，一行对应一个方法
            %   xlim([-2,2]);
            %   ylim([-2,1200]);
                %mean(b)  
             rec_mean(j,kc)=mean(rec_best(j,:));%%记录各个方法计算多次后多次均值（每个方法都算很多个均值）
            rec_var(j,kc)=var(rec_best(j,:));%%记录各个方法计算多次后多次方差（每个方法都算很多个方差）
        end
   
    end
end

% figure(1);
% ix=1:num;
% plot(ix,rec_mean(1,:),ix,rec_mean(2,:),ix,rec_mean(3,:));
% %legend('线性递减型惯性系数最优值均值变化','线性递增型惯性系数最优值均值变化','非线性递增型惯性系数最优值均值变化','w恒定为0.8惯性系数最优值均值变化');
% legend('线性递减型惯性系数最优值均值变化','线性递增型惯性系数最优值均值变化','非线性递增型惯性系数最优值均值变化');
% %title('速度位置型位置更新策略');
% title('直接位置更新型位置更新策略');
% figure(2);
% ix=1:num;
% plot(ix,rec_var(1,:),ix,rec_var(2,:),ix,rec_var(3,:));
% %legend('线性递减型惯性系数最优值方差变化','线性递增型惯性系数最优值方差变化','非线性递增型惯性系数最优值方差变化','w恒定为0.8惯性系数最优值方差变化');
% legend('线性递减型惯性系数最优值方差变化','线性递增型惯性系数最优值方差变化','非线性递增型惯性系数最优值方差变化');
% %title('速度位置型位置更新策略');
% title('直接位置更新型位置更新策略');

figure(1);
ix=1:num;
plot(ix,rec_mean(1,:),ix,rec_mean(2,:));
%legend('线性递减型惯性系数最优值均值变化','线性递增型惯性系数最优值均值变化','非线性递增型惯性系数最优值均值变化','w恒定为0.8惯性系数最优值均值变化');
legend('速度-位置型策略最优值均值变化','位置直接型策略最优值均值变化');
%title('速度位置型位置更新策略');
title('惯性权值非线性递增下位置更新策略');
figure(2);
ix=1:num;
plot(ix,rec_var(1,:),ix,rec_var(2,:));
%legend('线性递减型惯性系数最优值均值变化','线性递增型惯性系数最优值均值变化','非线性递增型惯性系数最优值均值变化','w恒定为0.8惯性系数最优值均值变化');
legend('速度-位置型策略最优值方差变化','位置直接型策略最优值方差变化');
%title('速度位置型位置更新策略');
title('惯性权值非线性递增下位置更新策略');


